#### 🖌 Terraform Format and Style ✅

#### ⚙️ Terraform Initialization ✅

#### 🤖 Terraform Validation ✅

<details><summary>Validation Output</summary>

```
```

</details>

#### 🦙 Terraform Lint ✅

<details><summary>Lint Output</summary>

```
```

</details>

#### 📖 Terraform Plan ✅

<details><summary>Show Plan</summary>

```diff
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
scaleway relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/demo-infrastructure/demo-infrastructure/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/demo-infrastructure/demo-infrastructure

To view this run in a browser, visit:
https://app.terraform.io/app/parca-dev/demo-infrastructure-scaleway/runs/run-ibPrqUkpo8gCGfWz

Waiting for the plan to start...

Terraform v1.5.7
on linux_amd64
Initializing plugins and modules...
scaleway_vpc.parca_demo: Refreshing state... [id=nl-ams/b286aeaa-3ad3-4118-b188-79b7a14b8a3b]
scaleway_vpc_private_network.parca_demo: Refreshing state... [id=nl-ams/5548d5ae-da8c-492b-a940-dfef6eebafbc]
scaleway_k8s_cluster.parca_demo: Refreshing state... [id=nl-ams/c2a026b7-5252-4729-b805-aeb910d8d789]
scaleway_k8s_pool.parca_demo_pool_gp1_xs: Refreshing state... [id=nl-ams/169a7656-b338-4987-8450-c976e5aae9a3]
scaleway_vpc_private_network.parca_demo: Drift detected (update)
scaleway_k8s_cluster.parca_demo: Drift detected (update)
scaleway_k8s_pool.parca_demo_pool_gp1_xs: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # scaleway_object_bucket.parca_analytics will be created
  + resource "scaleway_object_bucket" "parca_analytics" {
      + acl                 = "private"
      + endpoint            = (known after apply)
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "parca-analytics"
      + object_lock_enabled = false
      + project_id          = (known after apply)
      + region              = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>

*Pusher: @metalmatze, Action: `pull_request`, Working Directory: `scaleway`, Workflow: `Terraform`*